let x = +prompt ('Введіть координату х')
let y = +prompt ('Введіть координату y')

if (x > 8 || x <= 0 || y > 8 || y <= 0) {
    alert ('Значення мають бути додатніми і не більше 8')
} else {
    alert ('Прийняв. Введіть координату куди хочете походити')
}



let x1 = +prompt ('Введіть нову координату х')
let y1 = +prompt ('Введіть нову координату у')

if (x1 > 8 || x1 < 0 || y1 > 8 || y1 < 0) {
    alert ('фігура вийшла за рамки дошки, оберіть коректні координати')
}



if ((x1 == x+2) && ((y1 == y-1) || (y1 == y+1))) {
    alert('хороший хід')
} else if ((x1 == x+1) && ((y1 == y-2) || (y1 == y+2))) {
    alert('хороший хід')    
} else if ((x1 == x-2) && ((y1 == y-1) || (y1 == y+1))) {
    alert('хороший хід') 
} else if ((x1 == x-1) && ((y1 == y-2) || (y1 == y+2))) {
    alert('хороший хід')
}   else {
    alert('поганий хід, оберіть коректні координати')
}
